html/docker/kubernates-handbook/manual/config/resource-limit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>管理namespace中的资源配额</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="secret.html"> UP </a>
 |
 <a accesskey="H" href="config.html"> HOME </a>
</div><div id="content">
<h1 class="title">管理namespace中的资源配额</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4748c29">开启</a></li>
<li><a href="#org84163f3">示例</a>
<ul>
<li><a href="#org41631a4">配置计算资源配额</a></li>
<li><a href="#orgc9e8816">配置对象数量限制</a></li>
<li><a href="#orgaddc12d">配置CPU和内存LimitRange</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
当用多个团队或者用户共用同一个集群的时候难免会有资源竞争的情况发生，这时候就需要对不同团队或用户的资源使用配额做出限制 
</p>
<div id="outline-container-org4748c29" class="outline-2">
<h2 id="org4748c29">开启</h2>
<div class="outline-text-2" id="text-org4748c29">
<pre class="example" id="org25a4807">
目前有两种资源分配管理相关的控制策略插件 ResourceQuota 和 LimitRange
</pre>

<p>
要启用它们只要 API Server 的启动配置的 <span class="underline">KUBE_ADMISSION_CONTROL</span> 参数中：
</p>
<ul class="org-ul">
<li>加入了 <span class="underline">ResourceQuota</span> 的设置，这样就给集群开启了资源配额限制功能</li>
<li>加入 <span class="underline">LimitRange</span> 可以用来限制一个资源申请的范围限制</li>
</ul>

<pre class="example" id="orgc44e831">
两种控制策略的作用范围都是对于某 namespace：

ResourceQuota 用来限制 namespace 中所有的 Pod 占用的总的资源 request 和 limit

LimitRange 是用来设置 namespace 中 Pod 的默认的资源 request 和 limit 值
</pre>
<p>
资源配额分为三种类型：
</p>
<ul class="org-ul">
<li><span class="underline">计算</span> 资源配额</li>
<li><span class="underline">存储</span> 资源配额</li>
<li><span class="underline">对象</span> 数量配额</li>
</ul>
</div>
</div>
<div id="outline-container-org84163f3" class="outline-2">
<h2 id="org84163f3">示例</h2>
<div class="outline-text-2" id="text-org84163f3">
<pre class="example" id="orgcb47dee">
假设已经为 spark-cluster 这个 namespace 设置 ResouceQuota 和 LimitRange
</pre>
</div>
<div id="outline-container-org41631a4" class="outline-3">
<h3 id="org41631a4">配置计算资源配额</h3>
<div class="outline-text-3" id="text-org41631a4">
<pre class="example" id="org0f601f4">
apiVersion: v1
kind: ResourceQuota
metadata:
  name: compute-resources
  namespace: spark-cluster
spec:
  hard:
    pods: "20"
    requests.cpu: "20"
    requests.memory: 100Gi
    limits.cpu: "40"
    limits.memory: 200Gi
</pre>

<p>
要想查看该配置只要执行：
</p>

<div class="org-src-container">
<pre class="src src-sh">kubectl -n spark-cluster describe resourcequota compute-resources
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9e8816" class="outline-3">
<h3 id="orgc9e8816">配置对象数量限制</h3>
<div class="outline-text-3" id="text-orgc9e8816">
<pre class="example" id="org069d220">
apiVersion: v1
kind: ResourceQuota
metadata:
  name: object-counts
  namespace: spark-cluster
spec:
  hard:
    configmaps: "10"
    persistentvolumeclaims: "4"
    replicationcontrollers: "20"
    secrets: "10"
    services: "10"
    services.loadbalancers: "2"
</pre>
</div>
</div>
<div id="outline-container-orgaddc12d" class="outline-3">
<h3 id="orgaddc12d">配置CPU和内存LimitRange</h3>
<div class="outline-text-3" id="text-orgaddc12d">
<pre class="example" id="orge8eff5b">
apiVersion: v1
kind: LimitRange
metadata:
  name: mem-limit-range
spec:
  limits:
  - default:
      memory: 50Gi
      cpu: 5
    defaultRequest:
      memory: 1Gi
      cpu: 1
    type: Container
</pre>

<ul class="org-ul">
<li>default: limit 的值</li>
<li>defaultRequest: request 的值</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="secret.html">Previous: Secret</a></td>
<td class="org-left"><a href="config.html">Home：配置</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
